// - ให้คำนวณเงินฝากสะสมโดยปีที่ 1 มีเงินเริ่มต้น 100,000 ธนาคารให้ดอกเบี้ยร้อยละ 2.5 ต่อปี
// - โดยจ่ายดอกเบี้ยปีละครั้ง ดอกเบี้ยที่ได้จะสะสมและทบยอดไปในเงินฝากปีถัดไป
// - เมื่อครบ 10 ปี จะมียอดเงินฝากสะสมเท่าใด (ไม่มีการฝากเพิ่มและถอนออก)

// 1 ปี 100,000 ดอกเบี้ย 2.5/ปี(2.5/100)
// ฝาก 10 ปี

let num1 = 100000 ;
const year = 10 ;
const interest = 0.025 ;

for(let i =1; i<=year; i++){
    num1=num1+(num1*interest)
}
console.log(num1.toFixed(2));  

// result = 128008.45
//------ Complete ------
